In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1={
    "name":['Rajesh','Rahul','Ajay'],
    "marks":[56,73,46],
    "city":['GGN','DELHI','NOIDA']
}

In [3]:
df=pd.DataFrame(dict1)

In [4]:
df

     name  marks   city
0  Rajesh     56    GGN
1   Rahul     73  DELHI
2    Ajay     46  NOIDA

In [5]:
df.to_csv('name.csv')

In [6]:
df.to_csv('namewithoutindex.csv',index=False)

In [7]:
df.head(2)

     name  marks   city
0  Rajesh     56    GGN
1   Rahul     73  DELHI

In [8]:
df.tail(2)

    name  marks   city
1  Rahul     73  DELHI
2   Ajay     46  NOIDA

In [9]:
df.describe()

           marks
count   3.000000
mean   58.333333
std    13.650397
min    46.000000
25%    51.000000
50%    56.000000
75%    64.500000
max    73.000000

In [10]:
name =pd.read_csv('name.csv')

In [11]:
name

   Unnamed: 0    name  marks   city
0         0.0  Rajesh     56    GGN
1         1.0   Rahul     73  DELHI
2         2.0    Ajay     46  NOIDA
3         NaN   TEst1     56   city
4         NaN   TEst2     59    GGN
5         NaN   TEst3     36  DELHI
6         NaN   TEst4     76  NOIDA

In [12]:
name['name']

0    Rajesh
1     Rahul
2      Ajay
3     TEst1
4     TEst2
5     TEst3
6     TEst4
Name: name, dtype: object

In [13]:
name['name'][1]

'Rahul'

In [14]:
name['marks'][0]=100

C:\Users\rajes\AppData\Local\Temp\ipykernel_3172\3099709282.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  name['marks'][0]=100

In [15]:
name

   Unnamed: 0    name  marks   city
0         0.0  Rajesh    100    GGN
1         1.0   Rahul     73  DELHI
2         2.0    Ajay     46  NOIDA
3         NaN   TEst1     56   city
4         NaN   TEst2     59    GGN
5         NaN   TEst3     36  DELHI
6         NaN   TEst4     76  NOIDA